# --- Core toolchain & CLIs ---
brew "mise"             # unified runtime/version manager
brew "git"
brew "gh"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "eza"
brew "jq"
brew "yq"
brew "tree"

# GPG/signing
brew "gnupg"
brew "pinentry-mac"

# Shell prompt
brew "starship"

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# React Native / iOS helpers
brew "watchman"
brew "cocoapods"

# Build deps helpful for Ruby compiles on macOS
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "zlib"
brew "gmp"

# Datastores (run with `brew services start ...`)
brew "postgresql@16"
brew "redis"

# JS runtime (fast dev/test); Node will be installed via Mise
# Note: bun is installed via mise (see .mise.toml and setup steps), not Homebrew

# Containers (pick your preferred; OrbStack is the default choice here)
brew "colima"           # optional alternative to Docker Desktop

# --- GUI Apps (Casks) ---
cask "ghostty"          # GPU-accelerated terminal emulator
cask "orbstack"         # fast Docker on macOS (preferred)
cask "android-studio"   # Android SDK/AVD/JDK mgmt
cask "claude"           # Claude AI assistant
cask "cursor"           # primary editor w/ AI
cask "visual-studio-code" # secondary editor / ecosystem fallback
cask "zed"              # ultra-fast minimal editor
cask "tableplus"        # DB GUI
# cask "postico"        # (optional) Postgres GUI, if you prefer Postico

# --- Fonts ---
cask "font-meslo-lg-nerd-font"  # Nerd Font for Starship/Ghostty icons
